Cases/ZigZag/constant/HotStream/porousZones
// Friction Factor on 3 HotStream Cell Zones 

CentralChannelHot
{
    type           explicitPorositySource;
    active         true;
    explicitPorositySourceCoeffs
    {
        type           DarcyForchheimer;
        selectionMode  cellZone;
        cellZone       RegionI;
        DarcyForchheimerCoeffs
        {
            d          [0 -2 0 0 0 0 0] (0 0 0);
            f          [0 -1 0 0 0 0 0] ($f_par_h $f_per_h 0);
            coordinateSystem
            {
                x          (1 0 0);
                y          (0 1 0);
                #includeEtc "caseDicts/general/coordinateSystem/cartesianXY"
            }
        }
    }
}

InletHot
{
    type           explicitPorositySource;
    active         true;
    explicitPorositySourceCoeffs
    {
        type           DarcyForchheimer;
        selectionMode  cellZone;
        cellZone       RegionII;
        DarcyForchheimerCoeffs
        {
            d          [0 -2 0 0 0 0 0] (0 0 0);
            f          [0 -1 0 0 0 0 0] ($f_par_h $f_per_h 0);
            coordinateSystem
            {
                x          (1 0 0);
                y          (0 1 0);
                #includeEtc "caseDicts/general/coordinateSystem/cartesianXY"
            }
        }
    }
}

OutletHot
{
    type           explicitPorositySource;
    active         true;
    explicitPorositySourceCoeffs
    {
        type           DarcyForchheimer;
        selectionMode  cellZone;
        cellZone       RegionIII;
        DarcyForchheimerCoeffs
        {
            d          [0 -2 0 0 0 0 0] (0 0 0);
            f          [0 -1 0 0 0 0 0] ($f_par_h $f_per_h 0);
            coordinateSystem
            {
                x          (1 0 0);
                y          (0 1 0);
                #includeEtc "caseDicts/general/coordinateSystem/cartesianXY"
            }
        }
    }
}

// ************************************************************************* //
