Cases/ZigZag/system/HotStream/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p_rgh
    {
        solver           GAMG;
        tolerance        1e-7;
        relTol           0.01;
        smoother         DIC;
        maxIter          100;
    }

    "(U|h|e|k|epsilon)"
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-7;
        relTol          0.1;
    }
}

SIMPLE
{
    nUCorrectors    		2;
    nNonOrthogonalCorrectors 	0;
    rhoMax          		1000;
    rhoMin          		1;
    pRefCell    		0;
    pRefValue    		0;
    residualControl
    {
    "(U|h|e|k|epsilon)" 	1e-5;
    }
}

relaxationFactors
{
    fields
    {
        rho             1;
        p_rgh           0.7;
    }
    equations
    {
        U               0.6;
        "(h|e)"         0.6;
        k               0.6;
        epsilon         0.6;
    }
}

// ************************************************************************* //
